administrador/app/controllers/asesors_controller.rb

  def index
    @asesors = Asesor.all
---
SELECT * FROM `asesors`

  def show
    @asesor = Asesor.find(params[:id])
---
SELECT * FROM `asesors` WHERE (`asesors`.`id` = 1)

  def create
    @asesor = Asesor.new(params[:asesor])
    if @asesor.save
---
INSERT INTO `asesors` (`updated_at`, `imagen_content_type`, `nombre`, `puesto`, `imagen_updated_at`, `tel`, `imagen_file_name`, `imagen_file_size`, `cel`, `created_at`) VALUES('2010-07-14 16:17:19', 'image/jpeg', 'Carmen Orozco', 'Asesor kovi', '2010-07-14 16:17:17', '0444771790106', '02.jpg', 7163, '3251140', '2010-07-14 16:17:19')

  def edit
    @asesor = Asesor.find(params[:id])
---
SELECT * FROM `asesors` WHERE (`asesors`.`id` = 1)

  def update
    @asesor = Asesor.find(params[:id])
    if @asesor.update_attributes(params[:asesor])
---
SELECT * FROM `asesors` WHERE (`asesors`.`id` = 1)
UPDATE `asesors` SET `nextel` = '72*617070*6', `updated_at` = '2010-07-15 22:05:25' WHERE `id` = 1

  def destroy
    @asesor = Asesor.find(params[:id])
    @asesor.destroy
---
SELECT * FROM `asesors` WHERE (`asesors`.`id` = 2)
DELETE FROM `asesors` WHERE `id` = 2