administrador/app/controllers/noticias_controller.rb

SELECT * FROM `noticias`
---
  def index
    @noticias = Noticia.all

SELECT * FROM `noticias` WHERE (`noticias`.`id` = 1)
---
  def show
    @noticia = Noticia.find(params[:id])

INSERT INTO `noticias` (`updated_at`, `contenido`, `created_at`) VALUES('2010-07-14 16:36:23', 'Una decoración de la casa pesada y recargada de objetos obstaculiza el flujo del Chi. La decoración del dormitorio debe ser ligera y sin espejos para dormir bien ', '2010-07-14 16:36:23')
---
  def create
    @noticia = Noticia.new(params[:noticia])
    if @noticia.save

SELECT * FROM `noticias` WHERE (`noticias`.`id` = 1)
---
  def edit
    @noticia = Noticia.find(params[:id])

SELECT * FROM `noticias` WHERE (`noticias`.`id` = 1)
UPDATE `noticias` SET `imagen_updated_at` = '2010-07-15 22:17:49', `imagen_file_name` = '01.jpg', `imagen_file_size` = 3301, `updated_at` = '2010-07-15 22:17:50', `imagen_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @noticia = Noticia.find(params[:id])
    if @noticia.update_attributes(params[:noticia])

SELECT * FROM `noticias` WHERE (`noticias`.`id` = 2)
DELETE FROM `noticias` WHERE `id` = 2
---
  def destroy
    @noticia = Noticia.find(params[:id])
    @noticia.destroy